{
  "name": "Matheus G. Sturmer",
  "photo": "https://avatars.githubusercontent.com/mgsturmer",
  "job": "Full Stack Developer em React JS",
  "location": "Porto Alegre - RS",
  "phone": "(51) 99754-2504)",
  "email": "mgsturmer@gmail.com",
  "aboutme": "Oi, fico feliz de você ter você por aqui. Como dito acima, eu sou o Matheus, Matt ou Matsi para os íntimos. Sou ciclista, jogo xadrez, pratico musculação, amo acampar e também gosto muito de música eletrônica. As vezes me aventuro como support no DOTA 2. Durante muitos anos trabalhei com Informática especificamente para pesquisa clinica. No final de 2024 me desliguei do grupo e decidi virar a chave e realizar uma migração de carreira para me tornar desenvolvedor Full Stack. Aprendi a programar a muitos anos atrás quando entrei em engenharia de computação na UFRGS mas infelizmente não consegui terminar o curso.",
  "skills": {
    "hardSkills": [
      {
        "name": "JS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "Nodejs",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/nodejs.png"
      },
      {
        "name": "React",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/react.png"
      },
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "GitHub",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
      }    
    ],
    "softSkills": [
      "Empatia",
      "Liderança",
      "Trabalho em equipe",
      "Flexibilidade",
      "Criatividade",
      "Resolução de conflitos"
    ]
  },
  "languages": [
    "Português BR (Nativo)",
    "Inglês (Avançado)",
    "Espanhol (intermediário)"
  ],
  "portfolio": [
    {
      "name": "Desafio de código DIO - criação de uma Pokedex",
      "url": "https://github.com/mgsturmer/Full-Stack-em-React/tree/main/Full%20Stack%20em%20React/JavaScript/Modulo%202%20(JavaScript%20Web)",
      "github": true
    },
    {
      "name": "Este portfolio (código fonte)",
      "url": "https://github.com/mgsturmer/js-developer-portfolio",
      "github": true
    }

  ],
  "professionalExperience": [
    {
      "name": "Clinical Informatics Assistant | LACOG",
      "period": "2015 - 2024",
      "description": "Iniciei como bolsista e, após dois anos, tive a oportunidade de progredir para CLT, tornando-me referência no departamento de TI. Liderei uma equipe que variava entre 1 e 2 profissionais, coordenando a estratégia de coleta de dados para estudos clínicos em oncologia. Desenvolvi bancos de dados em uma plataforma específica com valor estatístico, capazes de responder aos objetivos da pesquisa, garantindo conformidade com GCP e LGPD. Desenvolvemos modelos e estruturas de coleta de dados com base em padrões internacionais, assim como conceitos e práticas de programação (reusabilidade, coesão, Keep it Simple), que melhoraram tanto o funcionamento interno no desenvolvimento dos projetos quanto a atuação de parceiros externos, majoritariamente da área da saúde. Atuei no monitoramento da coleta e qualidade dos dados, gerando scripts que asseguravam a integridade e relevância para a pesquisa. Tive também como atividade secundária a manutenção da segurança da informação, infraestrutura e suporte interno a outros colaboradores."
    },
    {
      "name": "Assistente de caixa - STR Supermercados",
      "period": "2008 - 2009",
      "description": "Responsável pela organização dos produtos adquiridos e pelo fornecimento de todo tipo de assistência necessária. Essa experiência inicial na carreira me proporcionou principalmente desenvolvimento de soft skills, exigindo habilidades de comunicação ao interagir diariamente com dezenas de clientes, além de lidar com situações adversas de forma eficiente e profissional."
    }
  ]
}