{
  "name": "Matheus G. Sturmer",
  "photo": "https://avatars.githubusercontent.com/mgsturmer",
  "job": "Full Stack Developer",
  "location": "Porto Alegre - RS",
  "phone": "(51) 99754-2504)",
  "email": "mgsturmer@gmail.com",
  "objectives": "Profissional com sólidos conhecimentos em JavaScript (ES6+), CSS, React.js, Node.js e experiência prática no desenvolvimento de aplicações web e mobile com React Js e Native, além de interfaces web escaláveis e performáticas. Tenho forte atenção à usabilidade, boas práticas de código, integração contínua e padrões de projeto. Atuei por quase uma década com tecnologia em  dados clínicos, desenvolvendo soluções internas, automatizando processos, liderando pequenas equipes e garantindo aderência a padrões internacionais de qualidade. Tenho familiaridade com bancos de dados relacionais (como MySQL), versionamento com GIT e metodologias ágeis. Busco contribuir tecnicamente em um time comprometido com a entrega de valor, a escalabilidade das soluções e o crescimento conjunto. Sou proativo, organizado e valorizo o bom relacionamento interpessoal. Sou uma pessoa que gosta de criar e aprender coisas novas, busco sempre me desafiar e impactar positivamente a vida das pessoas ao meu redor.",
  "skills": {
    "hardSkills": [
      {
        "name": "JS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "Nodejs",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/nodejs.png"
      },
      {
        "name": "React.js and React Native",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/react.png"
      },
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "GitHub",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/github.png"
      },
      {
        "name": "Scrum",
        "logo": "https://raw.githubusercontent.com/mgsturmer/js-developer-portfolio/refs/heads/main/data/imgs/scrum.png"
      }          
    ],
    "softSkills": [
      "Empatia",
      "Liderança",
      "Trabalho em equipe",
      "Flexibilidade",
      "Criatividade",
      "Resolução de conflitos"
    ]
  },
  "languages": [
    "Português BR (Nativo)",
    "Inglês (Avançado)",
    "Espanhol (intermediário)"
  ],
  "portfolio": [
    {
      "name": "GitHub Geral",
      "url": "https://github.com/mgsturmer",
      "github": true
    },
    {
      "name": "Desafio de código DIO - criação de uma Pokedex",
      "url": "https://github.com/mgsturmer/Full-Stack-em-React/tree/main/Full%20Stack%20em%20React/JavaScript/Modulo%202%20(JavaScript%20Web)",
      "github": true
    },
    {
      "name": "Este portfolio (código fonte)",
      "url": "https://github.com/mgsturmer/js-developer-portfolio",
      "github": true
    },
    {
      "name": "Desafio de código DIO - Calculadora em React",
      "url": "https://github.com/mgsturmer/Desafio-01-React---Calculadora",
      "github": true
    },
    {
      "name": "Desafio de código DIO - Corridas Mario Kart no Terminal em Node.js",
      "url": "https://github.com/mgsturmer/formacao-nodejs/tree/main/03-projeto-mario-kart",
      "github": true
    }
  ],
  "professionalExperience": [
    {
      "name": "Clinical Informatics Coordinator | LACOG",
      "period": "2022 - 2024",
      "description": "Gestão dos sistemas de coleta de dados clínicos, supervisionando a integridade e conformidade dos dados dos ensaios clínicos por nove anos. Supervisão e mentoria da equipe de Clinical Informatics, garantindo aderência aos protocolos rigorosos de pesquisa oncológica. Desenvolvimento e padronização de bancos de dados clínicos em conformidade com padrões nacionais e internacionais de qualidade. Liderança em iniciativas de garantia de qualidade de dados, incluindo validação automatizada via programação, relatórios automáticos, alertas em tempo real para desvios de protocolo e eventos clínicos significativos, além de relatórios financeiros. Gestão da infraestrutura de TI e suporte técnico interno para assegurar fluxo contínuo e seguro de dados. Participação ativa em estratégias de segurança e gestão de informações sensíveis, mantendo confidencialidade e conformidade regulatória. Criação e implementação de módulo interno EDC para eICF, melhorando adesão e conformidade dos pacientes."
    },
    {
      "name": "Clinical Informatics Analyst | LACOG",
      "period": "2020 - 2022",
      "description": "Estruturação de dados clínicos para análise estatística, garantindo integridade e conformidade regulatória.Desenvolvimento de soluções internas para gerenciamento de dados e colaboração próxima com equipes estatísticas e regulatórias. Implementação de melhorias no processo de coleta de dados, otimizando significativamente o fluxo de trabalho e garantindo prontidão do sistema no momento das aprovações regulatórias. Desenvolvimento e implementação de modelos de Randomização em ensaios clínicos."
    },
    {
      "name": "Clinical Informatics Assistant (Intern) | LACOG",
      "period": "2015 - 2020",
      "description": "Apoio no desenvolvimento de electronic case report forms (eCRFs) e bancos de dados clínicos. Participação em treinamentos internos e atividades de documentação, com ênfase em conformidade GCP."
    }
  ]
}